Revit 2015 API
TextNote Properties
The TextNote type exposes the following members.
Properties
Name | Description
Align
The align.
 (Inherited from TextElement.)
AssemblyInstanceId
 The id of the assembly instance to which the element belongs.
 (Inherited from Element.)
BaseDirection
The base direction.
 (Inherited from TextElement.)
BoundingBox
Retrieves a box that circumscribes all geometry of the element.
 (Inherited from Element.)
Category
Retrieves a Category object that represents the category or sub category in which the element resides.
 (Inherited from Element.)
Coord
Access the position of the TextNote object.
CreatedPhaseId
 Id of a Phase at which the Element was created.
 (Inherited from Element.)
DemolishedPhaseId
 Id of a Phase at which the Element was demolished.
 (Inherited from Element.)
DesignOption
Returns the design option to which the element belongs.
 (Inherited from Element.)
Document
Returns the Document in which the Element resides.
 (Inherited from Element.)
Geometry
Retrieves the geometric representation of the element.
 (Inherited from Element.)
GroupId
 The id of the group to which an element belongs.
 (Inherited from Element.)
Height
The height.
 (Inherited from TextElement.)
Id
 A unique identifier for an Element in an Autodesk Revit project.
 (Inherited from Element.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from Element.)
Leaders
Retrieves all the leaders belongs to the current TextNote object.
LevelId
 The id of the level associated with the element.
 (Inherited from Element.)
LineWidth
The line width.
 (Inherited from TextElement.)
Location
This property is used to find the physical location of an element within a project.
 (Inherited from Element.)
Name
A human readable name for the Element.
 (Inherited from Element.)
OwnerViewId
 The id of the view that owns the element.
 (Inherited from Element.)
Parameter[Guid]
Retrieves a parameter from the element given a GUID for a shared parameter.
 (Inherited from Element.)
Parameter[String]
Retrieves a parameter from the element given its name.
 (Inherited from Element.)
Parameter[BuiltInParameter]
Retrieves a parameter from the element given a parameter id.
 (Inherited from Element.)
Parameter[Definition]
Retrieves a parameter from the element based on its definition.
 (Inherited from Element.)
Parameters
Retrieves a set containing all of the parameters that are contained within the element.
 (Inherited from Element.)
ParametersMap
Retrieves a map containing all of the parameters that are contained within the element.
 (Inherited from Element.)
Pinned
 Identifies if the element has been pinned to prevent changes.
 (Inherited from Element.)
Symbol
Get the type of the TextElement object.
 (Inherited from TextElement.)
Text
Get and set the content of the TextElement object.
 (Inherited from TextElement.)
TextNoteType
Access the type of the TextNote object.
UniqueId
 A stable unique identifier for an element within the document.
 (Inherited from Element.)
UpDirection
The direction towards the top of the screen.
 (Inherited from TextElement.)
ViewSpecific
 Identifies if the element is owned by a view.
 (Inherited from Element.)
Width
Access the width of the TextNote object.
WorksetId
 Get Id of the Workset which owns the element.
 (Inherited from Element.)
See Also
TextNote Class
Autodesk.Revit.DB Namespace